# Pandas-DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [13]:
df.W.A

2.706849839399938

In [14]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
df['new'] = df['W'] + df['Y']

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [19]:
df.drop('new', axis=1, inplace=True)

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [22]:
# Selecting row

In [23]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [24]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [25]:
df.loc['B','Y']

-0.8480769834036315

In [26]:
df.loc[['A','B'],['W','Y','Z']]

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965

## Conditional selection

In [28]:
booldf = df > 0

In [30]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [34]:
result = df[df['W'] > 0]

In [35]:
result['Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [37]:
df[df['W'] > 0][['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
D  0.955057 -0.758872
E  0.683509  1.978757

In [40]:
df[(df['W']>0) & (df['Y']>1) ]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

or = |
and = &

df.reset_index(inplace = True)

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
new = 'ND MUM HYD CHN KOL'.split()

In [46]:
new

['ND', 'MUM', 'HYD', 'CHN', 'KOL']

In [47]:
df['Cities'] = new

In [48]:
df

          W         X         Y         Z Cities
A  2.706850  0.628133  0.907969  0.503826     ND
B  0.651118 -0.319318 -0.848077  0.605965    MUM
C -2.018168  0.740122  0.528813 -0.589001    HYD
D  0.188695 -0.758872 -0.933237  0.955057    CHN
E  0.190794  1.978757  2.605967  0.683509    KOL

In [49]:
df.set_index('Cities')

               W         X         Y         Z
Cities
ND      2.706850  0.628133  0.907969  0.503826
MUM     0.651118 -0.319318 -0.848077  0.605965
HYD    -2.018168  0.740122  0.528813 -0.589001
CHN     0.188695 -0.758872 -0.933237  0.955057
KOL     0.190794  1.978757  2.605967  0.683509

In [50]:
df

          W         X         Y         Z Cities
A  2.706850  0.628133  0.907969  0.503826     ND
B  0.651118 -0.319318 -0.848077  0.605965    MUM
C -2.018168  0.740122  0.528813 -0.589001    HYD
D  0.188695 -0.758872 -0.933237  0.955057    CHN
E  0.190794  1.978757  2.605967  0.683509    KOL